Repository: vermont42/Conjuguer
Catalog: Conjuguer/Assets/Localizable.xcstrings
Source language: en
Languages: fr

# AppIcon.beret
source: Beret
fr: Béret

# AppIcon.rooster
source: Rooster
fr: Coq

# BrowseView.sortOrder
source: Sort order
fr: Ordre de tri

# Game.endGame
source: End Game
fr: Terminer la partie

# Game.moveLeft
source: Move Left
fr: Aller à gauche

# Game.moveRight
source: Move Right
fr: Aller à droite

# Game.playGame
source: Play Game
fr: Jouer

# Game.playGameDescription
source: Pilot the Arc de Triomphe and pelt roosters and croissants with berets.
fr: Pilotez l’Arc de Triomphe et bombardez coqs et croissants de bérets.

# ImageInfo.davidCompton
source: photograph of David Compton taken in Paris, France during the early 1960s
fr: photographie de David Compton prise à Paris, en France, au début des années 1960

# ImageInfo.joshAdams
source: photograph of Josh Adams taken near Vacaville, California in 2021
fr: photographie de Josh Adams prise près de Vacaville, en Californie, en 2021

# Info.conditionnelPasséText
source: `Use` The ~conditionnel passé~ (past conditional) is used to express hypothetical statements. A clause containing a conditionnel-passé conjugation often follows a ~si~ clause containing a plus-que-parfait conjugation. Examples: “Moi, si j’avais $EU$ des meubles, j’aurais guetté un cabinet.” = “Me, if I $haD$ $haD$ furniture, I would have been looking for a cabinet.” - Émile Zola, L’assommoir “Toutes $aUraient$ $Pu$ faire un fleuve avec leurs pleurs!” = “Each could have $maDe$ a river with her tears!” - Charles Baudelaire, Les petites vielles `Conjugation` The conditionnel passé is formed from the ‡conditionnel présent‡ conjugation of ‡avoir‡ or ‡être‡ followed by the ‡participe passé‡. The section ~Agreement~ of this app’s description of the ‡participe passé‡ has information on choice of auxiliary and possible gender-and-number agreement.
fr: `Utilisation` Le ~conditionnel passé~ est utilisé pour exprimer les énoncés hypothétiques. Une proposition contenant une conjugaison du conditionnel passé suit souvent une proposition ~si~ contenant une conjugaison du plus-que-parfait. Exemples : « Moi, si j’avais $EU$ des meubles, j’aurais guetté un cabinet. » = « Me, if I $haD$ $haD$ furniture, I would have been looking for a cabinet. » - Émile Zola, L’assommoir « Toutes $aUraient$ $Pu$ faire un fleuve avec leurs pleurs ! » = « Each could have $maDe$ a river with her tears ! » - Charles Baudelaire, Les petites vielles `Conjugaison` Le conditionnel passé est formé par la conjugaison ‡conditionnel présent‡ d’‡avoir‡ ou d’‡être‡ suivi du ‡participe passé‡. La section ~Accord~ de cette application concernant le ‡participe passé‡ contient des informations sur le choix de l’auxiliaire et sur l’accord de genre et de nombre.

# Info.conditionnelPrésentText
source: `Uses` The ~conditionnel présent~ (present conditional) is used: • In past, indirect discourse about expected, predicted, or hoped-for events. “[I]l espérait … que son pauvre argent … lui $revIENDrait$ … considérablement plus dodu.” = “He hoped … that his poor little money … would come back to him one day considerably plumper.” - Gustave Flaubert, Madame Bovary • To indicate politeness with ‡pouvoir‡, ‡avoir‡, and ‡être‡. “Vous ne $pouRriez$ pas me prêter dix sous?” = “Couldn’t you lend me ten cents?” - Émile Zola, L’assommoir “Monsieur Swann, $vouDriez$-vous avoir la bonté de me permettre de vous présenter notre ami Saniette?” = “Mr. Swann, would you be so kind as to permit me to introduce to you our friend Saniette?” - Marcel Proust, Du côté de chez Swann • In ~si~ clauses about possible or hypothetical situations. “Si j’$Étais$ à ta place, moi, j’en trouverais bien!” = “If I $WERE$ in your place, I would find some!” - Gustave Flaubert, Madame Bovary `Conjugation` The stem of the conditionnel présent is the radical du futur. To this is added ais, ais, ait, ions, iez, or aient. Examples: ‡être‡: $AUrais$, $AUrais$, $AUrait$, $AUrions$, $AUriez$, $AUraient$ ‡étrécir‡: étrécirais, étrécirais, étrécirait, étrécirions, étréciriez, étréciraient ‡parler‡: parlerais, parlerais, parlerait, parlerions, parleriez, parleraient ‡prendre‡: prendrais, prendrais, prendrait, prendrions, prendriez, prendraient
fr: `Utilisations` Le ~conditionnel présent~ est utilisé : • Dans le passé et le discours indirect sur les événements attendus, prédits ou espérés. « [I]l espérait … que son pauvre argent … lui $revIENDrait$ … considérablement plus dodu. » = « He hoped … that his poor little money … would come back to him one day considerably plumper. » - Gustave Flaubert, Madame Bovary • Pour exprimer la politesse avec ‡pouvoir‡, ‡avoir‡ et ‡être‡. « Vous ne $pourriez$ pas me prêter dix sous ? » = « Couldn’t you lend me ten cents ? » - Émile Zola, L’assommoir « Monsieur Swann, $vouDriez$-vous avoir la bonté de me permettre de vous présenter notre ami Saniette ? » = « Mr. Swann, would you be so kind as to permit me to introduce to you our friend Saniette ? » - Marcel Proust, Du côté de chez Swann • Dans des propositions avec ~si~ sur les situations possibles ou hypothétiques. « Si j’$Étais$ à ta place, moi, j’en trouverais bien ! » = « If I $WERE$ in your place, I would find some ! » - Gustave Flaubert, Madame Bovary `Conjugaison` Le radical du conditionnel présent est le radical du futur. On y ajoute ais, ais, ait, ions, iez ou aient. Exemples : ‡être‡ : $AUrais$, $AUrais$, $AUrait$, $AUrions$, $AUriez$, $AUraient$ ‡étrécir‡ : étrécirais, étrécirais, étrécirait, étrécirions, étréciriez, étréciraient ‡parler‡: parlerais, parlerais, parlerait, parlerions, parleriez, parleraient ‡prendre‡ : prendrais, prendrais, prendrait, prendrions, prendriez, prendraient

# Info.creditsHeading
source: Credits
fr: Crédits

# Info.creditsText
source: Josh Adams developed ~Conjuguer~. Here is the source code of ~Conjuguer~: ‡https://github.com/vermont42/Conjuguer‡ Daniel Alston and Larry Sanger proposed and ideated Wiktionary, ~Conjuguer~’s primary source of French-to-English verb translations. Wiktionary content is licensed under the Creative Commons Attribution-ShareAlike 3.0 Unported License. URL: ‡https://en.wiktionary.org/wiki/Wiktionary:Text_of_Creative_Commons_Attribution-ShareAlike_3.0_Unported_License‡ David Brodsky wrote “French Verbs Made Simple(r)”, which provided two key insights to the developer of ~Conjuguer~. First, conjugations are combinations of stems, sometimes modified, and endings, usually predictable. Second, every French verb is conjugated using a French-verb ~model~. The number of models is ~much~ smaller than the number of irregular verbs. Ilona Coffre created ~Conjuguer~’s app icon. Wei Huang created ~Conjuguer~’s font, Work Sans, and licensed it under the Open Font License, available here: ‡https://scripts.sil.org/cms/scripts/page.php?item_id=OFL-FAQ_web‡ Adam Kilgarriff founded Lexical Computing, the company behind Sketch Engine, which is the source of ~Conjuguer~’s verb-frequency data. Kevin MacLeod (incompetech.com) wrote the song used in ~Conjuguer~’s app preview, “Backbay Lounge”. The song’s license follows. “Backbay Lounge” Kevin MacLeod (incompetech.com) Licensed under Creative Commons: By Attribution 4.0 License http://creativecommons.org/licenses/by/4.0/ Siham Messalti proofread the French version of Conjuguer. Xavier Nègre created Lexilogos, a collection of French dictionaries that ~Conjuguer~’s developer used for translations not available in Wiktionary. URL: ‡https://www.lexilogos.com/english/french_dictionary.htm‡ Franz Josef Och architected Google Translate, which ~Conjuguer~’s developer used to translate French definitions of verbs that were in the French, but not the English, Wiktionary. URL: ‡https://translate.google.com‡ Machio Okada and Hitoshi Oguriso created the Tableaux de conjugaison de l’ancien français, which ~Conjuguer~ uses for conjugation of ‡ester‡, ‡gésir‡, ‡issir‡, and certain other defective verbs. URL: ‡https://micmap.org/dicfro/introduction/tableaux-de-conjugaison‡ `Example Sentences — Sources & Licenses` Each verb’s screen shows an example sentence and its English translation, attributed to one of the sources below. ~Conjuguer~ thanks every author and institution that made these examples possible. ~Literature (public domain).~ Marcel Proust, « Du côté de chez Swann » (1913); Émile Zola, « L’Assommoir » (1877); Gustave Flaubert, « Madame Bovary » (1857); Jean de La Fontaine, « Fables » (1668–1694); and Molière, « Œuvres complètes » (1659–1673). The nested Old-French examples are from the « Chanson de Roland » (Oxford manuscript, 12th century, public domain); their English translations are original work by Claude (Opus 4.8). ~Swiss public documents (public domain — Art. 5 URG).~ Federal and cantonal reports of the Swiss Confederation and of the cantons of Geneva, Vaud, Valais, and Fribourg, together with cyber/IT guides of the Federal Office for Cybersecurity (OFCS/NCSC). Official Swiss publications are in the public domain under Article 5 of the Swiss Copyright Act. ~French government (Licence Ouverte / Etalab 2.0).~ Reports of ADEME, ANSSI / CERT-FR, CEREMA, CNIL, France Stratégie, INSEE, the Ministry of Health, and the Villani AI mission, reused under the Open Licence (Etalab) version 2.0: ‡https://www.etalab.gouv.fr/licence-ouverte-open-licence/‡. Attribution: the respective French public bodies. ~French Wikipedia (CC BY-SA 4.0).~ Some examples come from French Wikipedia articles: Académie française, Bicyclette, Bourse (économie), Dissolution de l’Assemblée nationale (France), Gymnastique artistique, Le Havre, Paris, Salaison, Sucre, and Taille de la vigne. This text is licensed under Creative Commons Attribution-ShareAlike 4.0 International: ‡https://creativecommons.org/licenses/by-sa/4.0/‡. Under the ShareAlike term, any adaptation of this Wikipedia text must be shared under the same license. ~AI-authored examples.~ Eighty-two verbs had no clean verbal use in any open-licensed corpus; their example sentences were written originally by Claude (Opus 4.8). These include 63 archaic verbs that appear in the « Chanson de Roland » but in no open modern corpus.
fr: Josh Adams a développé ~Conjuguer~. Voici le code source de ~Conjuguer~ : ‡https://github.com/vermont42/Conjuguer‡ Daniel Alston et Larry Sanger ont proposé et imaginé Wiktionary, la principale source de traductions de verbes du français vers l’anglais par ~Conjuguer~. Le contenu du Wiktionnaire est sous licence Creative Commons Attribution-ShareAlike 3.0 Unported License. URL : ‡https://en.wiktionary.org/wiki/Wiktionary:Text_of_Creative_Commons_Attribution-ShareAlike_3.0_Unported_License‡ David Brodsky a écrit « French Verbs Made Simple(r) », qui a fourni deux informations clés au développeur de ~Conjuguer~. Premièrement, les conjugaisons sont des combinaisons de radicaux, parfois modifiés, et de terminaisons, généralement prévisibles. Deuxièmement, chaque verbe français est conjugué à l’aide d’un ~modèle~ de verbe français. Le nombre de modèles est ~beaucoup~ inférieur au nombre de verbes irréguliers. Ilona Coffre a créé l’icône de l’application ~Conjuguer~. Wei Huang a créé la police de caractère de ~Conjuguer~, Work Sans, et lui a donné la licence Open Font License, disponible ici : ‡https://scripts.sil.org/cms/scripts/page.php?item_id=OFL-FAQ_web‡ Adam Kilgarriff a fondé Lexical Computing, la société qui a développé Sketch Engine, qui est la source des données de fréquence de verbe de ~Conjuguer~. Kevin MacLeod (incompetech.com) a écrit la chanson utilisée dans la vidéo de prévisualisation de ~Conjuguer~, « Backbay Lounge ». La licence de cette chanson suit. “Backbay Lounge” Kevin MacLeod (incompetech.com) Licensed under Creative Commons: By Attribution 4.0 License http://creativecommons.org/licenses/by/4.0/ Siham Messalti a relu la version française de Conjuguer. Xavier Nègre a créé Lexilogos, une collection de dictionnaires français que le développeur de ~Conjuguer~ a utilisé pour des traductions non disponibles dans le Wiktionnaire. URL : ‡https://www.lexilogos.com/english/french_dictionary.htm‡ Franz Josef Och a conçu Google Translate, que le développeur de ~Conjuguer~ a utilisé pour traduire les définitions françaises des verbes qui étaient dans le Wiktionnaire français mais pas dans le Wiktionnaire anglais. URL : ‡https://translate.google.com‡ Machio Okada et Hitoshi Oguriso ont créé les Tableaux de conjugaison de l’ancien français, que ~Conjuguer~ utilise pour les conjugaisons de ‡ester‡, ‡gésir‡, ‡issir‡ et certains autres verbes défectifs. URL : ‡https://micmap.org/dicfro/introduction/tableaux-de-conjugaison‡ `Phrases d’exemple — Sources et licences` L’écran de chaque verbe présente une phrase d’exemple et sa traduction anglaise, attribuée à l’une des sources ci-dessous. ~Conjuguer~ remercie chaque auteur et institution qui ont rendu ces exemples possibles. ~Littérature (domaine public).~ Marcel Proust, « Du côté de chez Swann » (1913) ; Émile Zola, « L’Assommoir » (1877) ; Gustave Flaubert, « Madame Bovary » (1857) ; Jean de La Fontaine, « Fables » (1668–1694) ; et Molière, « Œuvres complètes » (1659–1673). Les exemples imbriqués en ancien français proviennent de la « Chanson de Roland » (manuscrit d’Oxford, XIIᵉ siècle, domaine public) ; leurs traductions anglaises sont une œuvre originale de Claude (Opus 4.8). ~Documents publics suisses (domaine public — art. 5 LDA).~ Rapports fédéraux et cantonaux de la Confédération suisse et des cantons de Genève, Vaud, Valais et Fribourg, ainsi que des guides cyber/informatiques de l’Office fédéral de la cybersécurité (OFCS/NCSC). Les publications officielles suisses relèvent du domaine public en vertu de l’article 5 de la loi suisse sur le droit d’auteur. ~Administration française (Licence Ouverte / Etalab 2.0).~ Rapports de l’ADEME, de l’ANSSI / CERT-FR, du CEREMA, de la CNIL, de France Stratégie, de l’INSEE, du ministère de la Santé et de la mission Villani sur l’IA, réutilisés sous la Licence Ouverte (Etalab) version 2.0 : ‡https://www.etalab.gouv.fr/licence-ouverte-open-licence/‡. Attribution : les administrations françaises concernées. ~Wikipédia en français (CC BY-SA 4.0).~ Certains exemples proviennent d’articles de Wikipédia en français : Académie française, Bicyclette, Bourse (économie), Dissolution de l’Assemblée nationale (France), Gymnastique artistique, Le Havre, Paris, Salaison, Sucre et Taille de la vigne. Ce texte est sous licence Creative Commons Attribution-Partage dans les mêmes conditions 4.0 International : ‡https://creativecommons.org/licenses/by-sa/4.0/‡. En vertu de la clause de partage à l’identique, toute adaptation de ce texte de Wikipédia doit être partagée sous la même licence. ~Exemples rédigés par l’IA.~ Quatre-vingt-deux verbes n’avaient aucun usage verbal exploitable dans un corpus sous licence ouverte ; leurs phrases d’exemple ont été rédigées originalement par Claude (Opus 4.8). Parmi eux figurent 63 verbes archaïques présents dans la « Chanson de Roland » mais dans aucun corpus moderne ouvert.

# Info.dedicationHeading
source: Dedication
fr: Dédicace

# Info.dedicationText
source: David Compton was my high-school Nordic-skiing coach. He was also a French teacher but not initially ~my~ French teacher. He was aware of my interest in and aptitude for French, however. At the beginning of my junior year, I wasn’t going to be able to take French because of a schedule conflict with Advanced Placement English. So Mr. Compton created a five-days-a-week French-literature class just for me. A German exchange student named Julian Peters soon joined us. Using Volumes I and II of “Anthologie de la Littérature Française” by Robert Leggewie as our textbooks, we studied the greats of French literature from Chrétien de Troyes to Samuel Beckett. This literary study ultimately inspired ~Conjuguer~’s use of literary examples of tense use. I thoroughly enjoyed Mr Compton’s class, and my knowledge of French took a giant leap. At the end of the year, I achieved a maximum score on the French Advanced Placement test. At the beginning of my freshman year at Dartmouth College, I took a test to get credit for a major-level French class and, of the sixty freshmen who took the test, I was one of only three who passed. Mr. Compton already had a full class schedule in the fall of 1991, when he created the class for me. On some level, he might have enjoyed spending that class period puffing on his tobacco pipe, tinkering with his Macintosh computer. Solipsistic teen that I was, I never asked him ~why~ he sacrificed that time for me. But I can speculate. He studied at the Sorbonne during the 1960s and was a francophile. He may have recognized in me a shared interest in French and wanted to give me the opportunity to pursue it to the fullest extent possible. Whatever his motivation, I am grateful and dedicate this app to him. Thanks to Mr. Compton, the name of ~Conjuguer~ is correctly spelled. During my freshman year at Dartmouth College, I developed the predecessor to ~Conjuguer~, ~Le Conjugateur~, a HyperCard stack. During a break from school, I demonstrated ~Le Conjugateur~ to Mr. Compton. He was impressed but commented that I was consistently misspelling the French word for “conjugate”, “conjuguer”, as “conjuger”. A rapid correction ensued and endured.
fr: David Compton était mon entraîneur de ski nordique au lycée. Il était aussi professeur de français, mais il n’était pas mon professeur de français au départ. Il était cependant conscient de l’intérêt et des compétences que j’avais pour la langue française. Au début de ma troisième année, je ne pouvais pas assister aux cours de français à cause d’un conflit d’horaire avec Advanced Placement English. Alors M. Compton a donc créé un cours de littérature française de cinq jours par semaine, juste pour moi. Un étudiant allemand participant à un programme d’échange, nommé Julian Peters, s’est rapidement joint à nous. Nous avons utilisé comme manuels les volumes I et II de « L’anthologie de la littérature française » de Robert Leggewie et nous avons étudié les grands de la littérature française de Chrétien de Troyes à Samuel Beckett. Cette étude littéraire a finalement inspiré l’utilisation par ~Conjuguer~ d’exemples littéraires de l’utilisation des temps. J’ai beaucoup apprécié le cours de M. Compton et ma connaissance du français s’est énormément améliorée. À la fin de l’année, j’ai obtenu un score maximum au test de français Advanced Placement. Au début de ma première année à Dartmouth College, j’ai passé un test pour obtenir un crédit pour un cours de français de niveau supérieur et, sur les soixante étudiants de première année qui ont passé le test, j’étais l’un des trois qui l’ont réussi. M. Compton avait déjà un emploi du temps chargé à l’automne 1991, lorsqu’il a créé le cours pour moi. Il aurait peut-être aimé passer cette période de classe à tirer sur sa pipe à tabac ou à bricoler son ordinateur Macintosh. Adolescent solipsiste que j’étais, je ne lui ai jamais demandé ~pourquoi~ il avait sacrifié ce temps pour moi. Mais je peux faire des hypothèses. Il a étudié à la Sorbonne dans les années 1960 et était francophile. Il a peut-être reconnu en moi un intérêt commun pour le français et a voulu me donner l’opportunité de le poursuivre dans toute la mesure du possible. Quelle que soit sa motivation, je lui en suis reconnaissant et lui dédie cette application. Grâce à M. Compton, le mot ~Conjuguer~ est correctement orthographié. Pendant ma première année au Dartmouth College, j’ai développé le prédécesseur de ~Conjuguer~, ~Le Conjugateur~, une pile HyperCard. Lors d’une pause scolaire, j’ai fait une démonstration concernant ~Le Conjugateur~ à M. Compton. Il était impressionné mais il m’a fait savoir que j’avais constamment mal orthographié le mot français « conjuguer » comme « conjuger ». Une correction rapide a été effectuée et a duré.

# Info.defectivenessHeading
source: Defectiveness
fr: Défectuosité
